---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofCurveHeightAtWall
source: html/934249b8-aa86-4de6-6ab7-6e3c6c6ee525.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofCurveHeightAtWall Property

"Plate Offset From Base"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofCurveHeightAtWall { get; }
```